{
  "title": "La doble Cara del Barrio Chino",
  "slug": "la-doble-cara-del-barrio-chino",
  "summary": "Sigue la crónica de un ingenioso cronista de los años 20 para revelar la ‘doble cara’ del antiguo Barrio Chino (Raval): vida bohemia, secretos y contrastes.",
  "theme": "history",
  "neighborhood": "El Raval (Barrio Chino)",
  "coverImageUrl": "https://example.com/portada-barrio-chino.jpg",
  "durationMinutes": 50,
  "tags": ["raval","barrio chino","historia","años 20","gaudí","botero","absenta","monasterio","hospital"],
  "status": "published",
  "publishedAt": "2025-01-01T10:00:00.000Z",
  "startLocation": { "type": "Point", "coordinates": [2.171254, 41.378304] },

  "milestones": [
    {
      "order": 0,
      "type": "narrative",
      "title": "Intro",
      "description": "He encontrado las páginas perdidas de la libreta de un ingenioso cronista de los años 20. Su misión era escribir la 'otra' historia de Barcelona, la que no aparecía en las postales. Quería revelar la fascinante 'doble cara' del Barrio Chino: un lugar lleno de vida, contrastes y secretos asombrosos. ¿Me ayudáis a seguir su rastro y completar su crónica? ¡Vamos a sacar a la luz el legado que nos dejó! Nuestra primera parada está muy cerca, dirígete al número 65 del Carrer Sant Pau."
    },

    {
      "order": 1,
      "type": "narrative",
      "title": "Enigma 1 — Crónica General",
      "description": "He llegado al Bar Marsella, un auténtico portal en el tiempo. El cronista escribió: 'Mi crónica empieza aquí. El aire huele a historia y a anís. Los artistas venían buscando una musa líquida, una llave para la inspiración que era tan famosa por su color como por sus efectos. Era el secreto a voces de la bohemia de Barcelona.' ¡Vamos a descifrar ese secreto!",
      "location": { "type": "Point", "coordinates": [2.171254, 41.378304] }
    },
    {
      "order": 2,
      "type": "quiz",
      "title": "Enigma 1.1 — El Secreto del Hada Verde",
      "description": "(Selección Múltiple) \"El cronista menciona esa 'musa líquida'. Era un licor verde muy potente al que los artistas le pusieron un apodo mágico y poético. Estando aquí, frente a este templo bohemio, ¿sabrías decir cuál era ese apodo?\" (A) El Elixir de los Poetas (B) La Pócima Esmeralda (C) El Hada Verde (D) La Sangre del Diablo",
      "location": { "type": "Point", "coordinates": [2.171254, 41.378304] },
      "proximityRadiusM": 60,
      "riddle": { "question": "Selecciona la opción correcta", "acceptedAnswers": ["c","el hada verde"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): El apodo combina el color de la bebida con una criatura mitológica alada, famosa por inspirar sueños.",
        "Pista 2 (Fácil): La respuesta está relacionada con el color verde y un ser fantástico como \"Campanilla\".",
        "Pista 3 (Solución): La respuesta es (C) El Hada Verde."
      ],
      "points": 5
    },
    {
      "order": 3,
      "type": "riddle",
      "title": "Enigma 1.2 — ¿Quién buscaba inspiración aquí?",
      "description": "\"¡Correcto! El Hada Verde. Esa absenta era el combustible creativo de la ciudad. Precisamente, uno de los genios más universales de Barcelona venía aquí a buscar su inspiración. El cronista se pregunta: '¿Cuántas de las curvas de sus edificios nacieron aquí?'. ¿Qué arquitecto, creador de la Sagrada Familia, era un cliente habitual?\"",
      "location": { "type": "Point", "coordinates": [2.171254, 41.378304] },
      "proximityRadiusM": 60,
      "riddle": { "question": "Escribe el apellido del arquitecto", "acceptedAnswers": ["gaudí","gaudi","antoni gaudí","antoni gaudi"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): Su apellido se ha convertido en un adjetivo para describir algo con un estilo único y muy ornamentado.",
        "Pista 2 (Fácil): Verás su huella en el Park Güell, la Casa Batlló y, sobre todo, en la basílica más famosa del mundo.",
        "Pista 3 (Solución): La respuesta es Antoni Gaudí."
      ],
      "points": 5
    },
    {
      "order": 4,
      "type": "narrative",
      "title": "Recompensa 1",
      "description": "¡Correcto, era Antoni Gaudí! Cuentan que él, como muchos otros artistas de la talla de Picasso o Dalí, era un habitual de este templo bohemio. Y es que el 'Hada Verde' sigue todo un ritual. Imagínate la escena: te entregan la copa, agua, un terrón de azúcar y un tenedor. El arte consiste en dejar caer el agua sobre el azúcar, observando cómo se disuelve y endulza la bebida. ¡Algunos incluso le prenden fuego para caramelizarlo!\n\nDejemos la inspiración bohemia por un momento. Nuestra crónica continúa con una historia más silenciosa. ¡Dirígete a la Plaça de Vicent Martorell!"
    },

    {
      "order": 5,
      "type": "narrative",
      "title": "Enigma 2 — Crónica General",
      "description": "El cronista escribió: 'He seguido un rastro de historias silenciosas hasta una plaza con nombre de escritor. Allí, incrustado en una pared, encontré un mecanismo que era a la vez un acto de amor y de desesperación.' ¡Busquemos esa plaza!"
    },
    {
      "order": 6,
      "type": "riddle",
      "title": "Enigma 2.1 — La plaza del escritor",
      "description": "\"Estamos cerca. El cronista menciona una 'plaza con nombre de escritor'. Mira las placas de las calles a tu alrededor para orientarte. ¿Cuál es el apellido del escritor que da nombre a la plaza donde se encuentra nuestro objetivo?\"",
      "riddle": { "question": "Escribe el apellido", "acceptedAnswers": ["martorell"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): Es el autor de la famosa novela caballeresca \"Tirant lo Blanc\".",
        "Pista 2 (Fácil): El nombre de la plaza es Vicent ********.",
        "Pista 3 (Solución): La respuesta es MARTORELL."
      ],
      "points": 5
    },
    {
      "order": 7,
      "type": "location",
      "title": "Enigma 2.2 — El mecanismo silencioso",
      "description": "\"¡Genial, estás en la Plaça Vicent Martorell! Ahora, busca el 'mecanismo silencioso' del que hablaba la crónica, ese curioso agujero en la pared. Para demostrar que lo has encontrado, activa tu GPS y colócate justo delante de ese legado.\"",
      "location": { "type": "Point", "coordinates": [2.168614, 41.38418] },
      "proximityRadiusM": 25,
      "riddle": { "question": "Alternativa si falla el GPS", "acceptedAnswers": ["17"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): No es un edificio, sino un vestigio de madera incrustado en una pared de piedra. Es fácil pasarlo por alto.",
        "Pista 2 (Fácil): Busca la entrada a la Biblioteca Andreu Nin. El torno está en la pared, junto al portal número 17.",
        "Pista 3 (Solución): La solución es colocarte frente al torno de madera en la pared junto al número 17."
      ],
      "points": 10
    },
    {
      "order": 8,
      "type": "narrative",
      "title": "Recompensa 2",
      "description": "¡Eso es, estáis en el lugar exacto! Este torno giratorio es un testigo mudo de incontables historias. Permitía a las madres dejar a sus bebés al cuidado de las monjas de forma anónima. Era un acto de amor y desesperación que salvó muchas vidas.\n\nUna historia conmovedora, ¿verdad? Dejemos las sombras por un momento, porque el cronista también encontró la cara más moderna y divertida del barrio. ¡Busquemos a un guardián muy especial en la Rambla del Raval!"
    },

    {
      "order": 9,
      "type": "narrative",
      "title": "Enigma 3 — Crónica General",
      "description": "El cronista escribió: 'En medio de las leyendas sombrías, me topo con un guardián inesperado. Un felino de bronce, gigantesco y bonachón, que parece sonreírle a la gente en una gran rambla moderna abierta en el corazón del barrio.' ¡Vamos a encontrarlo!"
    },
    {
      "order": 10,
      "type": "quiz",
      "title": "Enigma 3.1 — ¿Cómo se llama la rambla moderna?",
      "description": "(Selección Múltiple) \"Primero, debemos encontrar esa 'rambla moderna'. ¿Cómo se llama?\" (A) La Rambla (B) Rambla de Catalunya (C) Rambla del Raval (D) Passeig de Gràcia",
      "riddle": { "question": "Selecciona la opción correcta", "acceptedAnswers": ["c","rambla del raval"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): A diferencia de La Rambla principal, esta es más ancha, abierta y peatonal en su centro, y lleva el nombre del barrio.",
        "Pista 2 (Fácil): No es la que baja a Colón, sino la que tiene una gran escultura de un animal en medio.",
        "Pista 3 (Solución): La respuesta es (C) Rambla del Raval."
      ],
      "points": 5
    },
    {
      "order": 11,
      "type": "location",
      "title": "Enigma 3.2 — El guardián inesperado",
      "description": "\"¡Perfecto! Ahora que estás en la Rambla del Raval, busca al 'guardián inesperado', ese felino gigantesco. Activa tu GPS para demostrar que estás cerca de él.\"",
      "location": { "type": "Point", "coordinates": [2.169861, 41.378135] },
      "proximityRadiusM": 25,
      "clues": [
        "Pista 1 (Difícil): Es obra de un artista colombiano famoso por sus figuras voluminosas.",
        "Pista 2 (Fácil): ¡Busca la escultura de un gato enorme en medio de la rambla!",
        "Pista 3 (Solución): La solución es acercarse a la estatua del Gato de Botero."
      ],
      "points": 10
    },
    {
      "order": 12,
      "type": "photo",
      "title": "Enigma 3.3 — La cara del guardián",
      "description": "\"El cronista quedó fascinado por el rostro de este guardián. Para demostrar que has encontrado su simpática cara, ¡sácale una foto!\"",
      "location": { "type": "Point", "coordinates": [2.169861, 41.378135] },
      "proximityRadiusM": 60,
      "riddle": { "question": "Alternativa si falla la cámara", "acceptedAnswers": ["gato"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): No fotografíes la escultura entera, sino un primer plano de su rostro sonriente y sus bigotes de bronce.",
        "Pista 2 (Fácil): Acércate y enfoca bien la cara del gato.",
        "Pista 3 (Solución): La solución es hacer una foto de la cara del Gato de Botero."
      ],
      "points": 10
    },
    {
      "order": 13,
      "type": "narrative",
      "title": "Recompensa 3",
      "description": "¡Esa es la cara! Este enorme felino de Fernando Botero es el símbolo de la renovación del barrio. Y aunque el cronista se fijó en su cara, la leyenda popular se centra en otra parte... Dicen que frotar sus testículos trae buena suerte. ¡Un secreto a voces!\n\nDejemos a nuestro amigable guardián y volvamos a la 'doble cara' del barrio. ¡Dirígete a la esquina del Carrer de Sant Pau con el Carrer d'En Robador!"
    },

    {
      "order": 14,
      "type": "narrative",
      "title": "Enigma 4 — Crónica General",
      "description": "El cronista escribió: 'Llego a una esquina donde la doble cara del barrio es más visible que nunca. Justo al lado de una calle de mala fama, se encuentra un tesoro románico, un oasis de paz. Lo sagrado y lo profano, pared con pared.' ¡Vamos a esa esquina!"
    },
    {
      "order": 15,
      "type": "riddle",
      "title": "Enigma 4.1 — La calle de mala fama",
      "description": "\"Estás en la esquina del Carrer de Sant Pau. El cronista habla de una calle de 'mala fama'. Mira la placa. ¿Cuál es el nombre de esa calle que significa 'ladrón'?\"",
      "location": { "type": "Point", "coordinates": [2.170093, 41.380267] },
      "proximityRadiusM": 60,
      "riddle": { "question": "Escribe el nombre", "acceptedAnswers": ["robador"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): El nombre de la calle, que empieza por R, hace referencia a la acción de quitarle algo a alguien por la fuerza.",
        "Pista 2 (Fácil): La calle se llama \"Carrer d'En R******\".",
        "Pista 3 (Solución): La respuesta es ROBADOR."
      ],
      "points": 5
    },
    {
      "order": 16,
      "type": "quiz",
      "title": "Enigma 4.2 — Lo sagrado junto a lo profano",
      "description": "\"¡Exacto! Ahora, date la vuelta. Justo al lado de esta calle profana, se alza ese 'oasis de paz'. ¿Qué tipo de edificio antiguo y sagrado puedes encontrar?\" (A) Una catedral gótica (B) Un monasterio románico (C) Un palacio renacentista (D) Una sinagoga medieval.",
      "riddle": { "question": "Selecciona la opción correcta", "acceptedAnswers": ["b","un monasterio romanico","un monasterio románico","monasterio románico","monasterio romanico"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): Su estilo es anterior al gótico, con muros gruesos y arcos de medio punto.",
        "Pista 2 (Fácil): Justo al lado verás un pequeño oasis con un claustro y una iglesia de piedra muy antigua.",
        "Pista 3 (Solución): La respuesta es (B), un monasterio románico."
      ],
      "points": 5
    },
    {
      "order": 17,
      "type": "quiz",
      "title": "Enigma 4.3 — ¿Qué significa ‘del Camp’?",
      "description": "\"¡Genial! El nombre de este monasterio revela su pasado solitario. Su apellido es 'del Camp'. ¿Qué significa 'del Camp' en catalán?\" (A) Del Canto (B) Del Campo (C) De la Campana (D) Del Campeón.",
      "riddle": { "question": "Selecciona la opción correcta", "acceptedAnswers": ["b","del campo"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): El nombre indica que el edificio estaba rodeado de terrenos de cultivo, fuera de las murallas de la ciudad.",
        "Pista 2 (Fácil): Si traduces \"field\" del inglés al catalán, tienes la respuesta.",
        "Pista 3 (Solución): La respuesta es (B) Del Campo."
      ],
      "points": 5
    },
    {
      "order": 18,
      "type": "narrative",
      "title": "Recompensa 4",
      "description": "¡Exacto, el Monasterio de Sant Pau del Camp! Su nombre significa \"del campo\" porque durante siglos se levantó aquí solo, ¡fuera de las murallas! Era un faro de fe y saber en la frontera de la ciudad, el ejemplo perfecto de cómo lo sagrado siempre ha convivido con el mundo más rudo.\n\nUna historia increíble... Pero el cronista descubrió que todas las historias confluían en un mismo lugar. ¡Vamos a descubrir el punto final en los cercanos jardines del Antiguo Hospital de la Santa Creu!"
    },

    {
      "order": 19,
      "type": "narrative",
      "title": "Enigma 5 — Crónica General",
      "description": "El cronista escribió: 'Termino mi viaje en el lugar que fue el centro de la salud de Barcelona durante siglos. Un magnífico complejo gótico donde todas las almas de la ciudad, desde los recién nacidos hasta los genios moribundos, encontraron su principio o su final.' ¡Vamos a los jardines!"
    },
    {
      "order": 20,
      "type": "location",
      "title": "Enigma 5.1 — Entra por la calle correcta",
      "description": "\"Primero, debemos entrar a este remanso de paz. Busca la entrada principal a los jardines del antiguo complejo. La encontrarás en una calle que comparte nombre con el edificio.\"",
      "location": { "type": "Point", "coordinates": [2.170000, 41.381110] },
      "proximityRadiusM": 25,
      "clues": [
        "Pista 1 (Difícil): La calle es una de las arterias principales del Raval y su nombre está ligado a la sanación.",
        "Pista 2 (Fácil): Estás buscando el Antiguo ******* de la Santa Creu, y su entrada está en el Carrer de l'*******. ",
        "Pista 3 (Solución): La solución es entrar por el Carrer de l'Hospital."
      ],
      "points": 10
    },
    {
      "order": 21,
      "type": "photo",
      "title": "Enigma 5.2 — La ojiva gótica",
      "description": "\"¡Ya estás dentro! El cronista se fija en el estilo gótico del edificio. Busca el elemento arquitectónico que se repite en las ventanas y galerías, con una forma de arco apuntado muy característica. ¡Sácale una foto a uno de estos arcos!\"",
      "location": { "type": "Point", "coordinates": [2.170000, 41.381110] },
      "proximityRadiusM": 60,
      "riddle": { "question": "Alternativa si falla la cámara", "acceptedAnswers": ["arco","arco gótico","arco gotico","ojiva","ojival"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): Este arco, a diferencia del románico que es redondo, parece una punta de flecha o una ojiva.",
        "Pista 2 (Fácil): Mira hacia la galería del segundo piso del edificio principal. ¡Está llena de ellos!",
        "Pista 3 (Solución): La solución es sacar una foto a cualquiera de los arcos góticos (ojivales)."
      ],
      "points": 10
    },
    {
      "order": 22,
      "type": "quiz",
      "title": "Enigma 5.3 — ¿Quién murió aquí?",
      "description": "\"Este lugar acogió a ricos y pobres. De hecho, aquí murió uno de los artistas que mencionamos al principio de nuestra crónica. ¿Quién fue?\" (A) Picasso (B) Dalí (C) Gaudí (D) Miró.",
      "riddle": { "question": "Selecciona la opción correcta", "acceptedAnswers": ["c","gaudí","gaudi"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): Fue atropellado por un tranvía y, al no ser reconocido, fue trasladado a este hospital para pobres, donde falleció.",
        "Pista 2 (Fácil): Es el mismo genio que buscaba inspiración en el Bar Marsella.",
        "Pista 3 (Solución): La respuesta es (C) Gaudí."
      ],
      "points": 5
    },
    {
      "order": 23,
      "type": "riddle",
      "title": "Enigma 5.4 — Cierra el círculo",
      "description": "\"Desde los bebés del torno hasta el genio modernista, todos pasaron por aquí. Para cerrar el círculo, activa el micrófono y di en voz alta la palabra que describe la función principal que tuvo este lugar durante 500 años.\"",
      "location": { "type": "Point", "coordinates": [2.170000, 41.381110] },
      "proximityRadiusM": 60,
      "riddle": { "question": "Di o escribe la palabra clave", "acceptedAnswers": ["hospital"], "caseSensitive": false },
      "clues": [
        "Pista 1 (Difícil): Hoy es una biblioteca, pero antes fue el lugar donde se trataba a los enfermos.",
        "Pista 2 (Fácil): Es un sinónimo de \"sanatorio\" o \"clínica\".",
        "Pista 3 (Solución): La respuesta es HOSPITAL."
      ],
      "points": 10
    },
    {
      "order": 24,
      "type": "narrative",
      "title": "Recompensa 5",
      "description": "¡Justo esa palabra: HOSPITAL! Has llegado al corazón de la crónica. Este magnífico edificio fue durante más de 500 años el principal Hospital de Barcelona. Por aquí pasaron todas las almas de la ciudad. Es el lugar perfecto para cerrar el círculo, ya que entre sus muros se guardan los ecos de todas las historias, las luminosas y las oscuras, que conforman el verdadero legado del Raval."
    },

    {
      "order": 25,
      "type": "narrative",
      "title": "Recompensa Final",
      "description": "Este viaje por el Raval ha desvelado su fascinante 'doble cara', un recorrido que nos ha llevado desde la inspiración bohemia de Gaudí y la cara moderna del Gato de Botero, hasta el drama silencioso del torno de expósitos y la paz de un monasterio antiguo. Hemos descubierto que todas estas historias, luminosas y oscuras, convergen en el Antiguo Hospital, y que su famoso apodo, 'Barrio Chino', no fue más que una etiqueta periodística que ocultaba la rica historia de un barrio obrero y diverso.\n\nAl final, la elección es tuya: ¿buscarás la suerte con la inspiración del 'Hada Verde' o seguirás la tradición de frotarle los... bueno, ya sabes qué, al gato?"
    },

    {
      "order": 26,
      "type": "narrative",
      "title": "Eulàlia Recomienda",
      "description": "A pocas calles del bar donde Gaudí buscaba inspiración, un torno giratorio recogía en silencio a los bebés abandonados de la ciudad."
    }
  ]
}
